In [2]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\admin\anaconda3\lib\site-packages (8.0.31)
Requirement already satisfied: protobuf<=3.20.1,>=3.11.0 in c:\users\admin\anaconda3\lib\site-packages (from mysql-connector-python) (3.19.6)

In [20]:
import mysql.connector as connection

In [30]:
try:
    mydb = connection.connect(host='localhost',user='root',passwd='mysql',use_pure=True)  
    #checking the connection
    query = 'SHOW DATABASES'
    cursor = mydb.cursor()  #Creating cursor to execute queries
    cursor.execute(query)
    result = cursor.fetchall()
    print(result)
except Exception as e:
    mydb.close()
    print(str(e))

[('data_info',), ('information_schema',), ('mysql',), ('performance_schema',), ('sakila',), ('sys',), ('world',)]

In [31]:
for i in result:
    print(i[0])

data_info
information_schema
mysql
performance_schema
sakila
sys
world

#Creating Database

In [32]:
try:
    mydb = connection.connect(host='localhost',user='root',passwd='mysql',use_pure=True)  
    #checkiyng the connection
    query = 'create database data_info'
    cursor = mydb.cursor()  #Creating cursor to execute queries
    cursor.execute(query)
except Exception as e:
    mydb.close()
    print(str(e))

1007 (HY000): Can't create database 'data_info'; database exists

#Creating an Table

In [42]:
try:
    mydb = connection.connect(host='localhost',database ='data_info',user='root',passwd='mysql',use_pure=True)  
    #checkiyng the connection
    query = "create table stu(id int(5) auto_increment primary key,name varchar(30), Regnodate date,class varchar(5))"
    cursor = mydb.cursor()  #Creating cursor to execute queries
    cursor.execute(query)
    print(mydb.is_connected())
except Exception as e:
    mydb.close()
    print(str(e))

1050 (42S01): Table 'stu' already exists

In [44]:
mydb = connection.connect(host='localhost',database ='data_info',user='root',passwd='mysql',use_pure=True)
cursor = mydb.cursor()

In [47]:
cursor.execute("insert into stu values(1,'Vignesh','2002-03-23','CSC')")

In [48]:
cursor.execute("insert into stu values(2,'Jai','2002-03-22','CSC')")
cursor.execute("insert into stu values(3,'Thamarai','2001-03-23','CSC')")
cursor.execute("insert into stu values(4,'Muthmayeen','2002-03-20','IT')")

#Accesing by pandas

In [49]:
import pandas as pd

In [50]:
mydb

In [52]:
df = pd.read_sql("select * from data_info.stu",mydb)

C:\Users\Admin\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [53]:
df

   id        name   Regnodate class
0   1     Vignesh  2002-03-23   CSC
1   2         Jai  2002-03-22   CSC
2   3    Thamarai  2001-03-23   CSC
3   4  Muthmayeen  2002-03-20    IT

#Storing into another database

In [57]:
df = df.drop(['id'],axis=1)

In [62]:
df.to_csv("detail.csv")

In [61]:
cur = mydb.cursor()
cur.execute("create table Updated_stu(name varchar(30), Regnodate date,class varchar(5))")

In [65]:
df

         name   Regnodate class
0     Vignesh  2002-03-23   CSC
1         Jai  2002-03-22   CSC
2    Thamarai  2001-03-23   CSC
3  Muthmayeen  2002-03-20    IT

In [73]:
from sqlalchemy import create_engine
engine = create_engine('sqlite://', echo=False)

In [74]:
df.to_sql('Updated_stu', engine, if_exists='replace', index = False)

4